Repository: 84000/data-translation-memory
Catalog: toh437-v1.tmx
Source language: bo
Languages: en

source: འཕགས་པ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཕྱག་འཚལ་ལོ། །འཕགས་མ་ལྷ་མོ་སྒྲོལ་མ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to noble Mañjuśrī, the youthful one. Homage to the noble goddess, Tārā.

source: སྒྲོལ་མ་འབྱུང་བའི་རྣལ་འབྱོར་རྒྱ་མཚོའི་རྒྱུད་ཀྱི་ནི། །
en: The tantra of The Arising of Tārā is an ocean of yogic practice.

source: གཞུང་དང་རྟོག་པ་ཉམས་ཤིང་ནུབ་པར་གྱུར་ནས་ཡང་། །
en: Although its scripture and practice manual had declined and disappeared,

source: སྒྲོལ་མ་འབྱུང་བའི་ཏིང་འཛིན་ཞེས་བྱ་རྒྱུད་ཀྱི་གཙོ། །
en: There was The Meditative Absorption of Tārā , chief among tantras.

source: དེ་ཡང་ནུབ་པར་གྱུར་ནས་རྟོག་པ་འདི་ཡང་འབྱུང་། །
en: Once that, too, became lost, this practice manual appeared.

source: སེམས་ཅན་མང་པོའི་དོན་དུ་རྣལ་འབྱོར་པ། །རྒྱས་པར་བསྟན་པའི་རྒྱུད་ལས་བསྡུས་བྱས་ནས། །རྟོག་པ་འདི་ནི་འཇིག་རྟེན་དབང་ཕྱུག་གསུངས། །
en: For the sake of many beings, and as a compendium to the tantras That elaborately teach the yogic practices, Lokeśvāra, Lord of the World, taught this manual of practice.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཉན་པར་གྱིས། །
en: Listen, all bodhisattvas!

source: འཇིག་རྟེན་སྐྱབས་མེད་གྱུར་ལ་རྣམ་བལྟས་ནས། །འགྲོ་ཀུན་དོན་བྱེད་པ་ཡི་ཚུལ་འདི་ནི། །སྡུག་བསྔལ་གསུམ་གྱིས་སྡུག་བསྔལ་གྱུར་བལྟས་ནས། །
en: This method that benefits all beings Is based on seeing that the world is without refuge, And tormented by the three types of suffering.

source: གུས་པ་ཆེན་པོས་ཁྱོད་ཀྱིས་བླང་བརབྱོས། །
en: Receive this with great reverence!

source: འཇིག་རྟེན་རྣམ་རྟོག་ཞི་བར་བྱ་ཕྱིར་རྟོག་པ་འདི། །སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ནི་རབ་ཏུ་གསུངས། །
en: In order to pacify the concepts of the world, All buddhas teach this manual of practice.

source: དཔལ་ལྡན་གྲུ་འཛིན་རི་ལ་འཇམ་དཔལ་དང་། །པདྨ་བསྣམས་དང་རྒྱལ་བར་བྱེད་པ་དང་། །སྒྲིབ་པ་རྣམ་སེལ་བློ་གྲོས་རྒྱ་མཚོ་དང་། །བྱམས་པ་ལ་སོགས་ཚོགས་རྣམས་ཐམས་ཅད་ཀྱིས། །གང་ཡང་ཆོས་ཀྱི་ཚིག་འདི་ཐོས་གྱུར་ནས།
en: On the holy Potala mountain, Mañjuśrī, Padmapāṇi, Jaya, Sarva­nivaraṇa­viṣkambhin, Sāgaramati, Maitreya, and others—the full gathering— All heard these words of the Dharma,

source: རྗེས་སུ་ཡི་རང་སྤྱི་བོས་གུས་ཕྱག་བྱས། །
en: Rejoiced, and bowed their heads to the ground in veneration.

source: རྒྱལ་བའི་སྲས་ཀྱིས་མངའ་བྱས་བསྟོད་པ་འམ། །
en: The children of the victorious ones mastered it and praised it;

source: ཡང་ན་གླུ་དང་དབྱངས་དག་བྱས་པ་ཡིས། །སྣ་ཚོགས་གར་གྱིས་འདི་ནི་མཆོད་པ་བྱས། །
en: They worshipped it with song, melody, And various types of dance.

source: གནོད་སྦྱིན་སྲིན་པོ་ཡི་དགས་འཇིག་རྟེན་དང་། །སྣ་ཚོགས་བུ་མོ་དང་ནི་རྒྱུ་སྐར་དང་། །ས་ཡི་དབང་དང་ལག་ན་རྡོ་རྗེ་དང་། །རླབས་རྣམས་སྣ་ཚོགས་ཅན་གང་གནས་པ་ཡི། །ཀླུ་ཡི་བུ་མོ་ཟུར་གྱིས་བལྟ་བས་ལྟ་བ་དང་། །ས་འོག་སྐྱོང་དང་ལྷ་དབང་གྲུབ་པའི་བུ་མོས་མཆོད། །
en: Yakṣas, rākṣasas, the world of ghosts, Various maidens, the heavenly bodies, Thunderbolt bearers, lords of the earth, Nāga girls who live in the billowing seas Where they cast coquettish glances, The guardians of the nether world, and the daughters of the surasiddhas—these all worshipped.

source: དྲི་ཟའི་རྒྱལ་མོ་ནུ་མ་ཤིན་ཏུ་རྒྱས་པ་དང་། །རིག་པ་འཛིན་དང་མི་འམ་ཅི་ཡི་ཆུང་མ་དང་། །གནོད་སྦྱིན་ཆུང་མ་རི་ཡི་བུ་མོའི་བུ་དག་ནི། །གང་ཡིན་བདག་དང་སྐྱབས་མེད་ཅེས་ནི་འདི་སྐད་སྨྲ། །
en: Gandharva queens with eye-catching breasts, Female knowledge holders, kiṃnarīs, Himavat’s daughters, as well as others, all spoke in this way: “For us there is no refuge.

source: གང་ཕྱིར་སྐྱབས་མེད་སྐྱབས་གྱུར་སངས་རྒྱས་བསྟན་པ་འདིར། །མགོན་མེད་མགོན་གྱུར་འཇིག་རྟེན་མགོན་པོ་
en: Yet this teaching of the Buddha is the refuge for those who have none. Protector of those without a refuge, protector of the world,

source: ཁྱོད། །བདེ་བ་བསྐྱེད་ཅིང་ངོ་མཚར་ཆེ་གྱུར་གང་། །
en: You engender bliss and great wonder

source: མགོན་པོ་ཚོགས་ཀྱི་ཚིག་དབང་འདི་ཐོས་ནས། །ཉིད་ཀྱི་དབང་དུ་བྱེད་པའི་གསང་སྔགས་གསུངས། །
en: The Lord, hearing these words of the assembly, Pronounced the secret mantra, which he himself mastered,

source: སྔགས་ཀྱི་རྒྱལ་པོ་བུད་མེད་ཀུན་ཐོས་པས། །མཐར་ཐུག་སངས་རྒྱས་བདེ་བ་དུ་མ་འབྱུང་། །
en: And upon hearing this king of mantras, all the females there Experienced numerous forms of the bliss of final buddhahood.

source: རྡོ་རྗེ་རེག་པས་ཁམས་ཀྱང་འཛག་པར་འགྱུར། །
en: By the touch of the vajra their bodies released the juice,

source: ཟུར་གྱིས་ལྟ་བར་བྱེད་པས་ལྟ་བྱེད་ཅིང་། །རྐང་པ་དག་ཀྱང་ས་ལ་གྱ་ཚོམ་འདོར། །
en: And casting sidelong glances, They impatiently stamped their feet on the ground.

source: འདོད་ཆགས་ཤིན་ཏུ་བདེ་བས་ཁུ་འབབ་ཚེ། །
en: Carried away by the bliss of passion, they let their juices flow.

source: འདི་ལྟར་མཐོང་ནས་ལྷ་ཡི་བུ་མོ་ལ། །འགྲོ་བ་དབང་བྱེད་ཀུ་རུ་ཀུལླེའི་སྔགས། །རས་རིས་བྲི་དང་གསང་སྔགས་བསྒྲུབ་པའི་ཕྱིར། །
en: May the Protector observe this and dispense Timely words to these celestial girls— The mantra of Kurukullā that enthralls wandering beings— And the practice of painting in combination with this mantra.

source: དུས་ལ་བབ་པའི་ཚིག་འདི་མགོན་སྨྲོས་ཞེས། །དེ་ལྟར་བཅོམ་ལྡན་འཇིག་རྟེན་མགོན་པོས་གསུངས། །དེ་ཚེ་འཇིག་རྟེན་དབང་ཕྱུག་ལས་རྣམས་རབ་ཏུ་གསུངས། །
en: When the Blessed One, the Protector of the World, had proclaimed his intent, He, the Master of the World, began to teach the stages of the ritual:

source: ཀུ་རུ་ཀུལླེའི་རི་མོའི་ལུགས། །གང་ཞིག་བྲིས་པ་ཙམ་གྱིས་ནི། །སྒྲུབ་པ་པོ་ཡིས་འབྲས་ཐོབ་པ། །དེ་ནས་ཡང་དག་བཤད་པར་བྱ།
en: The method for creating an image of Kurukullā, The mere painting of which Brings fruition to the practitioner, I will now explain in full.

source: རི་མོ་མཁན་ནི་གང་ཞིག་གིས། །
en: Who can create the picture?

source: ཚེས་གྲངས་གང་དང་དུས་གང་ལ། །
en: On which day of the month and at which hour?

source: སྒྲོལ་མ་འབྱུང་ལས་བཤད་པ་བཞིན། །དེ་ནི་བདག་གིས་བཤད་པར་བྱ།
en: That I shall now explain In accordance with the prescriptions of The Arising of Tārā

source: རི་མོ་མཁན་ནི་གང་ཞིག་གིས། །གང་གི་མིག་ནི་དམར་འགྱུར་ཞིང་། །ལག་པ་དེ་བཞིན་རྐང་པ་དམར། །བྱ་ཡི་མིག་ཅན་ཨེ་ནྱའི་རྐང་། །དེས་ནི་སྒྲོལ་མ་བྲི་བར་བྱ། །
en: The one who paints the picture Should have reddish eyes, As well as red hands and feet, Eyes like those of a bird, and the legs of a black antelope. It is such a person who shall draw the Savioress.

source: དཔྱིད་ཀྱི་ཟླ་བ་དང་པོ་ཡི། །མྱ་ངན་མེད་པའི་ཚེས་བརྒྱད་ཉིན། །ཐུན་ནི་ཕྱེད་དང་གཉིས་པ་ལ། །སྒྲོལ་མའི་མིག་ནི་བྲི་བར་བྱ། །
en: In the first month of spring On the eighth day of Caitra, Half-way through the second watch— This is when the eyes of Tārā should be drawn.

source: མངར་གསུམ་བཟའ་ཞིང་ཉ་ལ་སོགས། །ཤ་དང་ཆང་ཡང་སྤང་བར་བྱ།
en: The artist must eat the three sweets And abstain from fish, meat, and alcohol.

source: དམར་པོའི་གོས་ཀྱང་རྟག་ཏུ་བགོ། །
en: Always dressed in red,

source: དམར་པོའི་དྲི་ཡིས་རྟག་ཏུ་བྱུག །
en: He must be smeared with a red fragrant paste.

source: བྱམས་པའི་སེམས་ནི་བསྐྱེད་བྱས་ལ། །ཐོ་རངས་ཁྲུས་བྱས་བསངས་ནས་སུ། །
en: Having brought forth a mind of loving-kindness, He should bathe at dawn in a sanctified location.

source: ལན་གསུམ་གོས་ནི་བརྗེས་ནས་སུ། །དབང་དུ་བྱེད་མ་ཡང་དག་བྲི། །
en: Then, having changed into a garment of three pieces, He should correctly draw The Enchantress:

source: ཞལ་གཅིག་མིག་ནི་ཡངས་པ་དང་། །
en: Single-faced, with elongated eyes,

source: ཕྱག་བཞི་མ་ལ་གུར་གུམ་མདོག །
en: Four-armed and of the color of kunkuma

source: བཅུ་དྲུག་ལོ་ལོན་སྒེག་བཅས་འདྲ། །
en: Sixteen years old and displaying an amorous sentiment,

source: བུད་མེད་སྒྱུ་མས་རྒྱགས་པ་བྲི། །
en: puffed up with pride on account of her magical feminine charm.

source: གཞོན་ནུ་མ་དམར་སེར་མོས་བྱས་པའི་སྐུད་པ་ལས་རས་བྱས་ལ།
en: The canvas should be woven with a thread spun by a female of fair complexion.

source: དེ་དང་ཐགས་མཁན་གཉིས་ཀ་ཟན་དང་འོ་མ་བཟའ་བར་བྱ་ཞིང་།
en: Both she and the weaver should eat milk-porridge.

source: དེ་ནས་པདྨའི་གདན་ལ་སྟོད་གཡོགས་དམར་པོའི་གོས་དང་བཅས་པས་རིན་པོ་ཆེའི་རྣ་ཆ་དང་། རིན་པོ་ཆེའི་ཅོད་པན་དང་།
en: Upon a lotus seat, wearing an upper garment of red cloth, jewel earrings, and a jewel diadem,

source: གཡས་པས་མི་འཇིགས་པ་སྦྱིན་པ་དང་།
en: she displays the mudrā granting fearlessness with her lower right hand,

source: གཉིས་པས་མདའ་སྣ་རྩེར་འགེངས་པ།
en: and with her second right hand holds an arrow that she draws to the tip of her ear.

source: གཡོན་པས་གཞུ་འཛིན་པ་དང་། ཨུཏྤལ་དམར་པོ་གཉིས་པ་ན་བསྣམས་པ་དང་།
en: In her upper left hand she holds a bow, and in the second left, a red utpala.

source: འོད་དཔག་མེད་ཅོད་པན་ན་བཞུགས་པ་རིའི་ཕུག་ན་གནས་པའི་ཀུ་རུ་ཀུལླེའོ། །
en: Crowned by Amitābha, dwelling in a cave in the mountains, she is Kurukullā.

source: ཀུ་རུ་ཀུལླེའི་འོག་ཏུ་ནི་སྒྲ་གཅན་འཛིན་ནོ། །དེའི་སྟེང་དུ་འདོད་པའི་དབང་ཕྱུག་ཆུང་མ་དང་བཅས་པའོ། །
en: Below Kurukullā is Rāhu, and above him, Kāmadeva with his spouse.

source: འདོད་པའི་ལྷའི་སྟེང་དུ་ཟླ་བའི་དཀྱིལ་འཁོར་རོ། །དེ་ལ་པདྨ་དམར་པོའི་གདན་ནོ། །
en: Above Kāmadeva there is a moon disk, and upon the moon disk a red lotus seat.

source: དེ་ལ་གནས་པའི་སྣ་ཚོགས་པའི་ཆ་བྱད་ཅན་གྱི་བཅོམ་ལྡན་འདས་མ་བྲིས་ལ། རས་རིས་རབ་ཏུ་གནས་པར་བྱའོ། །
en: On this seat one must paint the Blessed Lady with all her beautiful features, and then consecrate her image.

source: དེའི་མདུན་དུ་མཆོད་པ་རྣམ་པ་བཅྭ་བརྒྱད་བྱས་ལ། ཡར་གྱི་ངོའི་ཚེས་བརྒྱད་ཟླ་བ་ཉའི་བར་དུ་བཟླས་པ་བྱའོ། །
en: In front of the painting, from the eighth through the full moon day, one should perform the eighteen-fold pūjā, and recite the mantra.

source: སྒྲོལ་མའི་སྙིང་པོ་ནི་འདི་ཡིན་ཏེ། ཨོཾ་ཀུ་རུ་ཀུ་ལླེ་ཧྲཱིཿཧཱུྃ་སྭཱ་ཧཱ་ཞེས་བྱ་བའི་སྔགས་སོ།
en: This is the heart essence of Tārā: oṃ kurukulle hrīḥ hūṃ svāhā This is the mantra.

source: དེ་ནས་སྔོན་དུ་བསྙེན་པ་འབུམ་ཙམ་བྱས་ལ།
en: Having done the preliminary propitiation consisting of 100,000 recitations,

source: ཡང་སྟོན་ཟླ་ཐ་ཆུངས་སམ། དཔྱིད་ཟླ་འབྲིང་པོའམ། དབྱར་ཟླ་འབྲིང་པོའི་སངས་རྒྱས་ལ་མཆོད་པའི་དུས་ཚིགས་ཀྱི་ཉིན་པར་
en: next, on a buddha-day in the month of Kārttika, Vaiśakha, or Āṣāḍha,

source: ཐོ་རངས་ཀྱི་ཁྲུས་བྱས་ལ་གསོ་སྦྱོང་བཟུང་ནས་མཆོད་པ་ཐམས་ཅད་ཀྱིས་མཆོད་ལ།
en: having bathed at dawn and observed the restoration of vows ceremony, the practitioner should offer a complete pūjā.

source: ཉན་ཐོས་ཀྱི་དགེ་འདུན་ལ་མཆོད་སྟོན་གསོལ། །དེ་ནས་ཐེག་པ་ཆེན་པོའི་གསང་སྔགས་པའི་ཚོགས་ལ་མཆོད་སྟོན་བྱས་ནས་ཡོན་ཕུལ་ལ།
en: He should present a feast for the congregation of listeners, and next offer a feast with gifts for the community of those practicing the secret mantra of the Great Vehicle.

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། ཇི་ལྟར་འདོད་པའི་དངོས་གྲུབ་བླང་བར་བྱའོ། །
en: Placing his right knee on the ground, and with his robe thrown over one shoulder, he should receive the desired accomplishments.

source: ཉན་ཐོས་ཀྱི་དགེ་འདུན་གང་ན་བཞུགས་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་དགའ་བའི་ཚོགས་རྣམས་ལ་ཕྱག་བྱས་ནས་བཟོད་པར་གསོལ་ཏེ། །
en: He should salute and ask the pardon of the saṅgha of listeners and the community of those who delight in the Great Vehicle.

source: གང་ན་བཅོམ་ལྡན་འདས་མའི་རས་རིས་བཀྲམ་པའི་ཕྱོགས་དེར་ཉེ་བར་སོང་ལ།
en: Having gone to the place where the painting of the Blessed Lady is displayed,

source: དངོས་གྲུབ་གང་འདོད་པའི་དོན་དུ་རིག་པ་འཛིན་པས་བསམ་གཏན་དང་ལྡན་པར་གནས་ལ་ཡི་གེ་གྲངས་ཀྱི་འབུམ་བཟླས་པ་བྱའོ། །
en: this knowledge holder should, for the sake of the desired accomplishments, enter meditation and recite the mantra one hundred thousand times for each of its syllables.

source: ཆ་གཅིག་གིས་ནི་ཤེས་རབ་འཕེལ། །
en: With the first third, insight increases;

source: ཆ་གཉིས་ཀྱིས་ནི་དབང་དུ་བྱེད། །
en: With the second third, enthrallment is achieved;

source: གང་ཞིག་ཆ་ནི་གསུམ་པ་ཡིས། །མིས་ནི་དུག་ཀྱང་འགུགས་པར་འགྱུར། །
en: And with the final third, The person will also neutralize poison.

source: མྱོས་ཤིང་འགྱིང་བའི་བུད་མེད་རྣམས་དང་ནི། །འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་ནི་མཆོད་པར་འགྱུར། །
en: By mad and haughty women, and by the entire world, This practitioner will be honored.

source: སྦྱོར་བ་གོམས་པས་ལྷ་མོ་མཛེས་རྣམས་ལ། །སྔགས་འཆང་དེས་ནི་ཅི་ལྟར་འདོད་པར་སྤྱོད། །
en: Because of familiarity with the practice, this mantra holder May do as he wishes with beautiful goddesses.

source: དེ་ཡི་མིང་ཙམ་གྱིས་ནི་མཚུངས་མེད་དུག་ཅན་འབྲོས་པ་དང་། །གདེངས་ཀའི་གཙོ་བོའི་འོད་ཀྱིས་དཔལ་ལྡན་དག་ཀྱང་ཉ་བཞིན་འགྱུར། །
en: The mere sound of his name will cause those of incomparable poison to flee, And even those as brilliant as the leader of the hooded will become just like a fish.

source: བཟླས་བརྗོད་ལྡན་པ་ཡི་ནི་ངག་གི་དབང་ཕྱུག་བྱེད་འགྱུར་བས། །རིག་པས་འགྱིང་བའི་སྟོབས་དང་ལྡན་པའི་མཁས་པའང་ལན་མེད་བྱེད། །
en: Those who engage in recitation, by means of their power of speech, Render speechless even the experts who posses the majestic power of spells.

source: རིག་པ་འཛིན་པ་གླང་པོ་རྟ་ཡི་རྒྱབ་ཏུ་ཞོན་པ་དང་། །
en: Holders of mantra, who ride elephants and horses,

source: རིག་མ་མཛེས་མས་ལེགས་པར་འཁྱུད་ཅིང་མགུལ་ནས་འཇུས་པ་ལས། །
en: Embraced by their beautiful consorts who clasp their necks—

source: སྔགས་རིག་པ་ཡི་གཙོ་བོ་ཡི་ནི་སྟོབས་ཀྱིས་རྒྱལ་བར་འགྱུར། །
en: These are conquered by the power of the best among mantra-adepts.

source: མཐར་གྱུར་པ་ཡི་རྒྱལ་སྲིད་ལོངས་སྤྱོད་དག་ལ་ཡིད་ཀྱིས་སྤྱོད།
en: Their minds partake of the pleasures of perfect kingdoms.

source: འདོད་པའི་ལྷ་ལས་དགའ་བའི་བུ་ལ་སོགས་པ་རི་ཁྲོད་མ། །སྲེད་མེད་བུ་ལས་དཔའ་མོ་མི་ཕྱེད་པ་ལས་བདེ་སོགས་དང་། །ཚོགས་བདག་ལས་ནི་དྲི་མེད་དབྱངས་ཀྱི་དབང་ཕྱུག་དཀར་མོ་དང་། །ས་འཛིན་ལྷ་ལས་ཕུན་ཚོགས་མངའ་བ་སྔགས་ཀྱིས་རྣམ་རྒྱལ་བྱེད། །
en: Rati from Kāmadeva and Pārvatī from Śiva; Similarly, Śrī from Nārāyaṇa, Śacī from Ākhaṇḍala, The white Amalagīśvariṇī from Vācaspati, and Lakṣmī from the Sustainer of the Earth— These they win by means of the mantra.

source: གསང་སྔགས་ལྡན་པར་བཅོམ་ལྡན་འདས་མ་གང་ཞིག་སྒོམ་བྱེད་པ། །དེས་ནི་སྣ་ཚོགས་གཏེར་དང་གསེར་དང་དངུལ་དང་རྣ་ཆ་དང་། །གོས་ལ་སོགས་པའི་ནོར་རྣམས་ཀུན་ལ་ཆེད་དུ་གང་བསམས་པ། །
en: Those who possess the mantra and meditate on the Blessed Lady Will gain various treasures, gold, silver, earrings, Garments, and other such wealth.

source: རྒྱལ་ལས་རྒྱལ་སྲིད་དབང་པོའི་ཡུལ་འདས་ཤིང་ལས་འབྲས་བུ་དང་། །ཀླུ་དང་ཆུ་ཀླུང་རྒྱ་མཚོ་རྣམས་ལས་ཆུ་རྣམས་འགུགས། །
en: Having taken the kingdom from the king, the fruit from the tree that transcends the senses, And the waters from the nāgas, rivers, and oceans,

source: སེམས་ཀྱིས་ཐམས་ཅད་མ་ལུས་ཀུན་ནས་ལོངས་སྤྱོད་བྱེད། །
en: Their minds will partake of whatever they wish for, without exception.

source: སྔགས་དང་ལྡན་པས་འཐུང་ཞིང་ཟས་ལ་སྔགས་ཀྱིས་དག་པར་བྱེད། །
en: Absorbed in the mantra, they drink and eat while purifying through the mantra.

source: སྐྱེ་བོ་སྔགས་མེད་པར་ནི་ལོངས་སྤྱོད་གྲུབ་པ་མེད། །
en: For people without the mantra, no enjoyment can be won.

source: ནགས་སྐྱེས་གླང་པོ་རྟ་མཆོག་རི་དགས་དང་ལྡན་པ། །དུག་བཅས་གདེངས་ཀ་ཅན་གྱི་སྦྲུལ་མཆོག་དང་། །ཆུ་སྲིན་ཆུ་གླང་སྟག་དང་བསེ་དག་དང་། །རང་གི་སྔགས་ཀྱི་སྟོབས་ཀྱིས་བཀུག་ནས་ནི། །
en: Wild elephants; best horses of noble breed; Best snakes, hooded and venomous; Crocodiles; water buffaloes; and rhinoceroses— These they summon by the power of their mantra.

source: གལ་ཏེ་སྙིང་རྗེའི་ལྟ་བས་འཇིག་རྟེན་འདི་ལྟར་སྡུག་བསྔལ་བས། །རྒུད་པར་གྱུར་པའི་མི་མཉམ་པ་ལ་བསྔགས་པ་དེས། །ཡིད་བཞིན་ནོར་བུ་བཞིན་དུ་འཇིག་རྟེན་ལ་ཕན་སྒྲོན་མ་ཡིན། །
en: If with the eye of compassion mantra adepts regard the world, Which is stricken by all sorts of suffering, They will become Tārā, benefitting the world like the wish-fulfilling jewel.

source: ཞོན་ཡང་ངོ་མཚར་མེད་པར་བྱས་པ་ཡི་ནི་མིག་དག་གིས། །ལྟ་བར་གལ་ཏེ་གསང་སྔགས་གྲུབ་པ་དེ་ཡིས་མཐོང་བར་འགྱུར། །
en: If also they look with eyes free from wonder, The mantra-adepts will thereby see.

source: འཇིག་རྟེན་མ་ལུས་སྒྲོན་མེར་བྱེད་ཅིང་ཞི་བར་བྱེད།
en: The entire world will become of Tārā and know peace.

source: བདུད་རྣམས་བཅོམ་ནས་ནོར་གྱི་ཆར་རྒྱུན་འབེབས་པར་བྱེད། །
en: Having overcome the demons, they bring down a rain of wealth;

source: དཔག་བསམ་ཤིང་དུ་གྱུར་ནས་འགྲོ་རྣམས་ཅི་འདོད་སྦྱིན་པར་བྱེད། །
en: As a wish-fulfilling tree, they grant beings whatever they wish for.

source: དེ་བཞིན་ཕོངས་པའི་འཇིག་རྟེན་རྣམས་ཀྱི་ཆེད་དུ་གོས་དག་དང་། །སྟན་དང་ཁྱིམ་དང་བླ་རེ་དག་ཏུ་སྒྲོལ་མས་མཛད་པ་དང་། །
en: Likewise, for the benefit of the destitute in the world Tārā creates clothes, seats, homes, and parasols.

source: ནོར་གྱི་དབང་ཕྱུག་མ་ལུས་པ་ཡི་ནོར་རྣམས་ཀུན་བཀུག་ནས། །སེམས་ཅན་ཀུན་ལ་ཕན་པའི་ཕྱིར་དུ་སྦྱིན་པར་བྱེད། །
en: Having drawn to them all the riches of the lords of wealth without exception, They give it away for the benefit of all beings.

source: རྒྱ་མཚོའི་གླིང་དུ་ཚོང་བའི་གྲུ་ཞིག་གྱུར་པའི་ཕོངས་པ་ལ། །གཟིངས་དང་གྲུ་ལ་སོགས་པར་སྒྲོལ་མས་མཛད་པར་འགྱུར། །
en: For those suffering on islands, due to the wreckage of their merchant vessels, Tārā creates boats, ships, and so on.

source: སྒྲོལ་མ་དེ་བསྒོམས་རྣལ་འབྱོར་པ། །དང་པོ་སྡུག་བསྔལ་ལྷན་ཅིག་གྱུར།
en: The yogins who meditate on this Tārā Will first experience some suffering.

source: དེ་སྤངས་ནས་ནི་ཅུང་ཞིག་ན། །མིས་ནི་སྟོན་མོ་རྙེད་པར་འགྱུར། །
en: Yet once that is over, such people Will soon discover feasts.

source: གཉིས་པར་གོས་ནི་རྙེད་པར་འགྱུར། །དེ་བཞིན་བཙུན་མོ་དང་ཡང་འཕྲད།
en: Next they will acquire garments, Just as they will meet with noble women.

source: དེ་ནས་སོ་རྩི་ལོངས་སྤྱོད་འགྱུར། །
en: Then they will enjoy the betel.

source: མ་བླངས་པར་ཡང་ཅི་འདོད་སྤྱོད།
en: That which they wish for will be obtained without asking.

source: དགེ་བ་བཅུ་ལ་དགའ་འགྱུར་ཞིང་། །ཐེག་པ་ཆེ་ལ་སེམས་གཅིག་པས། །
en: Those who delight in the ten virtues, And are single-minded in their devotion to the Great Vehicle,

source: གལ་ཏེ་ཚངས་སྤྱོད་ཡིན་ན་ཡང་། །ལྷ་མཆོག་བསྐྱེད་པའི་བུ་མོ་སྤྱོད། །
en: Even if one is celibate, One may engage with a woman of supreme, celestial birth.

source: རྡོ་རྗེ་ཆོས་ཀྱི་བཀའ་བཞིན་དུ། །དངོས་གྲུབ་མཆོག་ནི་དེས་སྤྱོད་འགྱུར། །
en: Will, in accordance with Vajradharma’s words, Hereby experience the supreme accomplishment.

source: སེམས་ཅན་གསོད་ལ་དགའ་བ་ཡིས། །བསྟན་པ་འདི་ལ་འགྲུབ་མི་འགྱུར། །
en: Those who take pleasure in killing sentient beings Will not succeed in this discipline.

source: འདི་ནི་རས་རིས་ལ་འཇུག་པའི་རྟོག་པ་སྟེ་དང་པོའོ།། །
en: This was the first chapter, the instructions for the practice of painting.

source: འདི་ནི་རས་རིས་ལ་འཇུག་པའི་རྟོག་པ་སྟེ་དང་པོའོ། །
en: This was the first chapter, the instructions for the practice of painting.

source: ཆོས་མཆོད་པ་ཡི་སྦྱོར་བ་ཡིས། །གང་གི་ཆོས་ཉིད་བརྙེས་གྱུར་ན། །ཆོས་ཀྱི་དབྱིངས་སུ་རང་གྱུར་པ། །
en: Through the method of worship in accordance with the Dharma, One will attain dharmatā And oneself will become the dharmadhātu.

source: དེ་ནས་ཡང་དག་བཤད་པར་བྱ། །
en: That shall now be correctly explained.

source: དེའི་རྗེས་ལ་དཔག་བསམ་ཤིང་གི་སྒྲུབ་པ་འབྱུང་བར་འགྱུར་རོ། །
en: Now follows the practice method of the wish-fulfilling tree:

source: བྲག་གི་ཡི་གེ་ལས་བྱུང་བ། །དཔག་བསམ་ཤིང་ནི་རྣམ་པར་བསྒོམ། །
en: One should visualize, arising from the syllable vṛm , A wish-fulfilling tree.

source: ཨུཏྤལ་ཡོངས་སུ་གྱུར་པ་ལས། །ཤིང་ནི་གཡོན་དུ་བསྒོམ་པར་བྱ། །
en: As a transformation of the utpala, It should be visualized to the left.

source: སྣ་ཚོགས་ནོར་གྱི་ཆར་པ་དག །ནམ་མཁའི་དཀྱིལ་ནས་འབབ་པ་ཡིས། །འདོད་པའི་བསམ་པ་རྫོགས་བྱེད་པ། །
en: A rain of various riches Falls from the middle of the sky, And so fulfills wishes and desires.

source: དེ་ལྟར་བསྒོམས་ན་ནོར་བདག་འགྱུར། །
en: The one who meditates like this becomes the Lord of Wealth.

source: ཡོངས་ཀྱི་གཙོ་བོ་རིན་ཆེན་དང་། །དེ་བཞིན་རིན་ཆེན་རྒྱ་མཚོ་སྐྱེས། །བུད་མེད་རིན་ཆེན་རྟ་རིན་ཆེན། །དེ་བཞིན་རལ་གྲི་རིན་ཆེན་དང་། །གླང་པོ་རིན་ཆེན་སོགས་རིན་ཆེན། །སངས་རྒྱས་རྣམས་ལ་ཡིད་ཀྱིས་དབུལ། །
en: The jewel of the foremost teacher, The jewel born from the sea, The jewel of a woman, the jewel of a horse, The jewel of a sword, The jewel of an elephant—such jewels Should be offered mentally to the buddhas.

source: གླིང་བཞི་པ་ཡི་སེམས་ཅན་རྣམས། །སེམས་ཀྱི་འོད་ཟེར་གྱིས་བཀུག་ནས། །
en: The sentient beings of the four continents One must summon through light rays of the mind

source: རྟག་ཏུ་རིན་ཆེན་བདུན་རང་བཞིན། །དེ་དག་ལ་ནི་རབ་སྦྱིན་བྱ། །
en: And so generously provide them With the gifts that consist of the seven jewels:

source: བུད་མེད་རྒྱན་གྱིས་བརྒྱན་བྱས་ལ། །
en: a woman, adorned with ornaments

source: སྣ་ཚོགས་གཟུགས་ཅན་འགྱིང་བ་རྣམས།
en: And displaying abundant attractions,

source: སངས་རྒྱས་འབྲས་བུ་འདོད་རྣམས་ཀྱིས། །སངས་རྒྱས་རྣམས་ལ་རྟག་ཏུ་དབུལ། །
en: Should always be offered to the buddhas By those who wish for the fruit of buddhahood.

source: རིན་པོ་ཆེ་ནི་ཡོངས་རྒྱས་པའི། །ཡོངས་ཀྱི་གཙོ་བོ་ནོར་དབང་ཕྱུག །
en: Replete with his treasures, A foremost teacher, a lord of wealth,

source: འདིས་ནི་སངས་རྒྱས་ཐམས་ཅད་དང་། །རིག་པ་འཛིན་པ་ཐོབ་པར་འགྱུར། །
en: Through this all buddhas And knowledge holders will be achieved.

source: སངས་རྒྱས་འབྲས་བུ་འདོད་པ་ཡིས། སངས་རྒྱས་རྣམས་ལ་དབུལ་བར་བྱ། །
en: Should be offered to the buddhas By those who wish for the fruit of buddhahood.

source: དེ་བཞིན་རིན་ཆེན་གཞན་དག་ཀྱང་། །གུས་དང་བཅས་པས་ཡོངས་བཏང་ན། །
en: When likewise the other jewels Are respectfully surrendered

source: རྡོ་རྗེ་ཆོས་སུ་གྱུར་ནས་ནི། །སེམས་ཅན་ཀུན་གྱི་དོན་བྱེད་འགྱུར། །
en: One will turn into Vajradharma And so become the benefactor of all beings.

source: འདི་ནི་དཔག་བསམ་ཤིང་གི་སྒྲུབ་པའི་ཐབས་སོ། །
en: This was the practice method of the wish-fulfilling tree.

source: སེམས་ཉིད་སངས་རྒྱས་ཐམས་ཅད་དོ། །
en: All the buddhas are mind itself.

source: སེམས་ཉིད་ཀྱིས་ནི་རྣམ་པར་གྲོལ། །
en: By mind itself one is liberated.

source: སེམས་ཀྱིས་འཆིང་བ་རྣམས་ལས་ཐར། །
en: Bondage is broken by the mind,

source: སངས་རྒྱས་ཉིད་དང་དངོས་གྲུབ་ཀུན། །གང་ཕྱིར་ཕུན་ཚོགས་གཞན་མ་མཐོང་། །
en: there is no perfection to be seen Apart from buddhahood and all the accomplishments.

source: སེམས་ཀྱིས་གྲོལ་བ་དང་ལྡན་འགྱུར། །
en: Through mind one attains freedom.

source: སེམས་མ་གཏོགས་པར་དངོས་དོན་རྣམས། །གཞན་དག་གཞན་པར་མ་མཐོང་སྟེ།
en: Apart from in the mind Things and entities are not seen anywhere at all.

source: གང་ཡང་སྣོད་དང་སེམས་ཅན་རྣམས། །འབྱུང་དང་འབྱུང་ལས་གྱུར་པ་དག །ཟག་མེད་ལྷག་པར་མཐོང་བ་ཡིས། །སེམས་ཙམ་ཡིན་ཞེས་རབ་ཏུ་བསྒྲགས། །
en: The environments and sentient beings, The elements and their derivatives, Have been declared to be “mind only” By those who possess the undefiled special vision.

source: དེ་བས་འབད་པ་ཐམས་ཅད་ཀྱིས། །སེམས་ཀྱི་མེ་ལོང་ཕྱིས་བྱས་ན། །
en: Therefore, one should make every effort To cleanse the mirror of the mind.

source: རང་བཞིན་གློ་བུར་བ་ཡི་སྐྱོན། །རིམ་གྱིས་རབ་ཏུ་ཟད་པར་འགྱུར། །
en: Faults, which are by nature extrinsic, Will gradually be utterly exhausted.

source: དབྱངས་ཡིག་དང་པོ་ལས་བྱུང་བ། །དྲི་མེད་རྫོགས་པའི་ཟླ་བ་སྟེ། །
en: From the first of the vowels Arises a stainless full moon.

source: དྲོ་བ་རྣམས་ཀྱི་བཞི་པ་ན། །མེ་ཡི་མདོག་གི་སྟེང་ན་གནས། །
en: The fourth in the sibilant group Is positioned atop the syllable of fire,

source: སེམས་ཉིད་ཟླ་བར་བསྒོམ་བྱས་ནས། །དེ་ཡི་སྟེང་དུ་ས་བོན་དགོད། །
en: Meditating on mind itself as that moon, One places upon it the seed-syllable:

source: ཡི་གེ་ཨི་དང་ཡང་དག་ལྡན། །ནམ་མཁའ་གཉིས་ཀྱིས་རྣམ་པར་བརྒྱན། །
en: Joined with the syllable ī , And adorned with the two skies.

source: དེ་ཡི་སྣ་ཚོགས་འོད་རྣམས་ཀྱིས། །འགྲོ་བའི་དྲི་མ་མེད་བྱས་ནས། །སྟོང་གསུམ་འདི་སོགས་མཁའ་དབྱིངས་ཏེ། །
en: A multicolored light from that Cleanses beings of their impurities, And turns this billion-fold world, and other such universes, into the field of space.

source: དེ་ནས་མཁས་པས་ས་བོན་ལ། །མཆོད་པ་ཆེན་པོའི་སྤྲིན་རྣམས་སྤྲོ། །
en: The wise must then from the syllable Send forth a great cloud of offerings:

source: ཀུ་རུ་ཀུལླེའི་རིར་ཞུགས་པས། །དེ་ཡིས་སྒྲོལ་མ་བསྐུལ་ནས་ནི། །བཀུག་ནས་མདུན་དུ་གནས་པར་བྱེད།
en: Having entered the Kurukullā mountain It rouses Tārā, and as she is summoned, She is made to be present before oneself.

source: མེ་ཏོག་སྤོས་དང་མར་མེ་དང་། །དེ་བཞིན་དྲི་དང་ལྷ་བཤོས་སོགས། །ཕྱག་རྒྱ་ཕྲེང་བ་དེ་བཞིན་དུ། །གར་དང་གླུ་ཡིས་མཆོད་སོགས་མཆོད། །
en: Flowers, incense, and lamps; Perfume, food, and the like; Gestures, garlands, Theatrical shows, songs, and other such offerings.

source: དཀོན་མཆོག་གསུམ་ལ་སྐྱབས་སུ་མཆི། །
en: “The three jewels are my refuge;

source: སྡིག་པ་ཐམས་ཅད་སོ་སོར་བཤགས། །
en: I confess all my wrongdoings;

source: འགྲོ་བའི་དགེ་ལ་རྗེས་ཡི་རང་། །
en: I rejoice in the virtues of wandering beings;

source: སངས་རྒྱས་བྱང་ཆུབ་ཡིད་ཀྱིས་བཟུང་། །
en: I set my mind on the enlightenment of a buddha”—

source: སྔགས་འདི་ལན་གསུམ་བརྗོད་ནས་ནི། །
en: These words should be spoken three times,

source: དེ་ནས་གཤེགས་སུ་གསོལ་བར་བགྱི། །
en: After which one requests departure.

source: སེམས་ནི་བྱམས་པས་གནས་བྱས་ལ། །སླར་ཡང་དེར་ནི་གཞག་པར་བྱ། །
en: When the mind has been made to abide through love, It should again be placed there.

source: སྙིང་རྗེའི་སེམས་ནི་བསྐྱེད་བྱས་ནས། །རབ་དགའི་སེམས་ཀྱང་བསྐྱེད་པར་བྱ། །
en: Having engendered a mind of compassion, One should as well bring forth a mind of joy.
